# SF Salaries Exercise

** Import pandas as pd.**

In [1]:
import pandas as pd      #import pandas library  as pd

** Read Salaries.csv as a dataframe called sal.**

In [ ]:
Salaries.csv

In [4]:
s=pd.read_csv('Salaries.csv')      #read fill

In [5]:
s

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.0,0.00,0.00,2014,NaN,San Francisco,NaN
148650,148651,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,NaN,NaN,NaN,NaN,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

** Check the head of the DataFrame. **

In [6]:
s.head()   #first 5 row

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

** Use the .info() method to find out how many entries there are.**

In [7]:
s.info()     #FULL DATA

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

**What is the average BasePay ?**

In [17]:
a= s.groupby('BasePay')  #to get groupby BasePay
a.mean()               #to get mean value in BasePay

,Id,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
BasePay,,,,,,,,,
-166.01,72833.0,249.02,0.00,6.56,83.01,89.57,2012.0,NaN,NaN
-121.63,72866.0,182.70,0.00,5.44,61.07,66.51,2012.0,NaN,NaN
-109.22,72873.0,163.83,0.00,4.32,54.61,58.93,2012.0,NaN,NaN
-106.60,72875.0,159.90,0.00,4.66,53.30,57.96,2012.0,NaN,NaN
-101.88,72879.0,153.08,0.00,4.55,51.20,55.75,2012.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...
313312.52,72932.0,0.00,0.00,82319.51,313312.52,395632.03,2013.0,NaN,NaN
313686.01,72927.0,0.00,23236.00,85431.39,336922.01,422353.40,2013.0,NaN,NaN
315572.01,72930.0,0.00,0.00,82849.66,315572.01,398421.67,2013.0,NaN,NaN
318835.49,110533.0,10712.95,60563.54,89540.23,390111.98,479652.21,2014.0,NaN,NaN
319275.01,72926.0,0.00,20007.06,86533.21,339282.07,425815.28,2013.0,NaN,NaN

** What is the highest amount of OvertimePay in the dataset ? **

In [21]:
otp= s.sort_values(by='OvertimePay') # get it sort
otp.max()                           #get max values

Id                         148654
EmployeeName           Zuri Jones
JobTitle              ZOO CURATOR
BasePay                 319275.01
OvertimePay             245131.88
OtherPay                400184.25
Benefits                 96570.66
TotalPay                567595.43
TotalPayBenefits        567595.43
Year                         2014
Notes                         NaN
Agency              San Francisco
Status                        NaN
dtype: object

In [20]:
by_comp = s.groupby('OvertimePay')     # get it sort
by_comp.mean()                         #get max values

,Id,BasePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Status
OvertimePay,,,,,,,,,
-0.01,90715.000000,75033.030000,1540.000000,28864.640000,76573.020000,105437.660000,2013.000000,NaN,NaN
0.00,77093.868897,59052.468386,1635.883031,21193.423915,60229.348901,76220.693271,2012.513237,NaN,NaN
0.02,44426.000000,97435.010000,9587.680000,41501.430000,107022.710000,148524.140000,2012.000000,NaN,NaN
0.52,99025.000000,48955.570000,5090.120000,17354.010000,54046.210000,71400.220000,2013.000000,NaN,NaN
0.77,33722.000000,3940.530000,26.070000,NaN,3967.370000,3967.370000,2011.000000,NaN,NaN
...,...,...,...,...,...,...,...,...,...
173547.73,110575.000000,94191.040000,19740.810000,38238.570000,287479.580000,325718.150000,2014.000000,NaN,NaN
192424.49,36164.000000,126863.190000,17917.180000,44438.250000,337204.860000,381643.110000,2012.000000,NaN,NaN
196689.18,72965.000000,95123.000000,16622.660000,36125.490000,308434.840000,344560.330000,2013.000000,NaN,NaN
220909.48,36160.000000,128808.870000,13126.310000,44430.120000,362844.660000,407274.780000,2012.000000,NaN,NaN
245131.88,2.000000,155966.020000,137811.380000,NaN,538909.280000,538909.280000,2011.000000,NaN,NaN

** What is the job title of  JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll). **

In [50]:
#name= 'JOSEPH DRISCOLL'   #set namen
#sarch=loc['name']     #sarch for it 
                          #get job title
#sarch=s.sort_values(by='EmployeeName')
#sarch==['JOSEPH DRISCOLL'] 
#[s[['EmployeeName']]=='JOSEPH DRISCOLL']
#.dropna(thresh=1)
name=s['EmployeeName']      #get name"EmployeeName"
s[name=='JOSEPH DRISCOLL']  #sarch  JOSEPH DRISCOLL

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.86,97868.77,31909.28,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN

** How much does JOSEPH DRISCOLL make (including benefits)? **

In [52]:
total =s['JobTitle']   #get  JobTitle
total[24]                  #  24 is row JOSEPH DRISCOL

'CAPTAIN, FIRE SUPPRESSION'

** What is the name of highest paid person (including benefits)?**

In [55]:
sal=pd.DataFrame(s)    # bot it to data frame
sal.max()             #max

Id                         148654
EmployeeName           Zuri Jones
JobTitle              ZOO CURATOR
BasePay                 319275.01
OvertimePay             245131.88
OtherPay                400184.25
Benefits                 96570.66
TotalPay                567595.43
TotalPayBenefits        567595.43
Year                         2014
Notes                         NaN
Agency              San Francisco
Status                        NaN
dtype: object

** What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?**

In [56]:
sal.min()                  #min

Id                                 1
EmployeeName        A BERNARD FATOOH
JobTitle               ACCOUNT CLERK
BasePay                      -166.01
OvertimePay                    -0.01
OtherPay                    -7058.59
Benefits                      -33.89
TotalPay                     -618.13
TotalPayBenefits             -618.13
Year                            2011
Notes                            NaN
Agency                 San Francisco
Status                           NaN
dtype: object

** What was the average (mean) BasePay of all employees per year? (2011-2014) ? **

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

** How many unique job titles are there? **

In [40]:
s['JobTitle'].nunique()         #git JobTitle and cuunt unique

2159

** What are the top 5 most common jobs? **

In [32]:
s['JobTitle'].value_counts().head(5)    #git JobTitle  counts it   and  git top 5

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

** How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?) **

In [49]:
year_2013=s['Year']                      # get colom year
year_2013=='2013'                # filter to 2013
year_2013.dropna()

0         2011
1         2011
2         2011
3         2011
4         2011
          ...
148649    2014
148650    2014
148651    2014
148652    2014
148653    2014
Name: Year, Length: 148654, dtype: int64

In [38]:
s[s[['Year']]=='2013'].value_counts()    #git year felter it to 2013  and count it

Series([], dtype: int64)

** How many people have the word Chief in their job title? (This is pretty tricky) **

In [47]:
w=s[s[['Job Titles']]=='Chief']        #git tob titles felter if to cief
w=w.dropna()                           #drop nun
w.value_counts()                       #count it

KeyError: "None of [Index(['Job Titles'], dtype='object')] are in the [columns]"

477

** Bonus: Is there a correlation between length of the Job Title string and Salary? **

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

# Great Job!